spec/example.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:m0="http://rnd-soft.ru" xmlns:smev="http://smev.gosuslugi.ru/rev120315" xmlns:m2="http://localhost/operations/1/xsd" xmlns:m3="http://www.w3.org/2004/08/xop/include">
  <soap:Body wsu:Id="body">
    <m0:SendRequestRq>
<smev:Message>
<smev:Sender>
<smev:Code/>
<smev:Name/>
</smev:Sender>
<smev:Recipient>
<smev:Code/>
<smev:Name/>
</smev:Recipient>
<smev:Originator>
<smev:Code/>
<smev:Name/>
</smev:Originator>
<smev:TypeCode>GSRV</smev:TypeCode>
<smev:Date/>
</smev:Message>
<smev:MessageData>
<smev:AppData>
<m2:Документ ВерсФорм="4.02" ИдЗапросП="999999999999999999999999999999999999">
<m2:СвЮЛ НаимЮЛ="9" ИННЮЛ="9999999999" ОГРН="9999999999999"/>
<m2:ЗапросНП ДатаНа="9999999999">
<m2:ИННЮЛ>9999999999</m2:ИННЮЛ>
</m2:ЗапросНП>
<m2:ЗапросНП ДатаНа="8888888888">
<m2:ИННЮЛ>8888888888</m2:ИННЮЛ>
</m2:ЗапросНП>
<m2:ЗапросНП ДатаНа="7777777777">
<m2:ИННЮЛ>7777777777</m2:ИННЮЛ>
</m2:ЗапросНП>
</m2:Документ>
</smev:AppData>
<smev:AppDocument>
<smev:BinaryData/>
<smev:Reference/>
<smev:DigestValue/>
</smev:AppDocument>
</smev:MessageData>
</m0:SendRequestRq>
  </soap:Body>
</soap:Envelope>